// Copyright 2019 Diffuse Logic, all rights reserved.

#ifndef DL_CORE_MATH_H
#define DL_CORE_MATH_H

#include "dl_defines.h"
#include <cmath>
#include <cstring>

// Basic math library. Probably we will replace this with glm at some point. Though it is nice to
// have something simple in a single header.

namespace dl {
namespace math {

//=================================================================================================
//  Compiler.
//=================================================================================================

#if defined(_MSC_VER)
    #pragma warning( push )
    #pragma warning(disable: 4201) // C4201: nameless struct/union.
    #pragma warning(disable: 4127) // C4127: conditional expression constant.
#elif defined(__clang__)
    #pragma clang diagnostic push
#elif defined(__GNUC__)
    #pragma GCC diagnostic push
#endif

//=================================================================================================
// Vector declarations.
//=================================================================================================

template<Dim N, typename S> struct VecT;

typedef VecT<2, Float>      Vec2f;
typedef VecT<2, Double>     Vec2d;
typedef VecT<2, Int32>      Vec2i;
typedef VecT<2, UInt32>     Vec2u;

typedef VecT<3, Float>      Vec3f;
typedef VecT<3, Double>     Vec3d;
typedef VecT<3, Int32>      Vec3i;
typedef VecT<3, UInt32>     Vec3u;

typedef VecT<4, Float>      Vec4f;
typedef VecT<4, Double>     Vec4d;

template<typename S> static DL_MATH_INL S                      sum( HslT<S> c ) { return op::sum<3, S>( c ); }
template<typename S> static DL_MATH_INL HslT<S>                abs( HslT<S> c ) { return op::abs<3, S, HslT<S>>( c ); }
template<typename S> static DL_MATH_INL Bool                   equal( HslT<S> l, HslT<S>r ) { return op::op_equal<3>( l, r ); }
template<typename S> static DL_MATH_INL Bool                   zerolike( HslT<S> q ) { return op::zerolike<3>( q ); }
template<typename S> static DL_MATH_INL const S&               elem( HslT<S> q, Dim i ) { return op::op_index<3, S>( q, i ); }
template<typename S> static DL_MATH_INL Int32                  compare( HslT<S> l, HslT<S> r ) { return op::compare<3>( l, r ); }
template<typename S> static DL_MATH_INL RgbT<S>                toRgb( HslT<S> c ) { return op::op_hsltorgb( c ); }
template<typename S> static DL_MATH_INL RgbaT<S>               toRgba( HslT<S> c ) { return op::op_hsltorgba( c ); }

} // math

//=================================================================================================
// Define dl::ds::hash for math types.
//=================================================================================================

namespace ds {
template<Dim N, typename S> static DL_MATH_INL UInt64          hash( math::VecT<N, S> v ) { return hash<N, math::VecT<N, S>>( v ); }
template<Dim N, typename S> static DL_MATH_INL UInt64          hash( math::PosT<N, S> p ) { return hash<N, math::PosT<N, S>>( p ); }
template<       typename S> static DL_MATH_INL UInt64          hash( math::QuatT<S> q ) { return hash<4, math::QuatT<S>>( q ); }
template<Dim N, typename S> static DL_MATH_INL UInt64          hash( const math::MatT<N, S>& m ) { return hash<N, math::MatT<N, S>>( m ); }
template<       typename S> static DL_MATH_INL UInt64          hash( math::RgbT<S> c ) { return hash<3, math::RgbT<S>>( c ); }
template<       typename S> static DL_MATH_INL UInt64          hash( math::RgbaT<S> c ) { return hash<4, math::RgbaT<S>>( c ); }
template<       typename S> static DL_MATH_INL UInt64          hash( math::HsvT<S> c ) { return hash<3, math::HsvT<S>>( c ); }
template<       typename S> static DL_MATH_INL UInt64          hash( math::HslT<S> c ) { return hash<3, math::HslT<S>>( c ); }
} // ds

//=================================================================================================
// Macro for setting up N-tuple specializations.
//=================================================================================================

namespace math {

#define DL_MATH_SETUP_STRUCT(NUM,SCALAR) \
    enum { N = NUM };                     \
    DL_MATH_MAKE_TYPEDEFS(SCALAR)

#define DL_MATH_SETUP_STRUCT_WITH_S(NUM,SCALAR) \
    enum { N = NUM };                     \
    typedef SCALAR S;                     \
    DL_MATH_MAKE_TYPEDEFS(SCALAR)

//=================================================================================================
// Vec2.
//=================================================================================================

template<typename S> struct VecT<2, S> DL_FINAL
{
    DL_MATH_SETUP_STRUCT( 2, S );

    union
    {
        struct { S x, y; };
        struct { S u, v; };
        struct { S a, b; };
        S m[N];
        S comp[N];
    };

    static const V2 zero;
    static const V2 one;
    static const V2 unitX;
    static const V2 unitY;

    static DL_MATH_INL V2 make()
    {
        return make( 0, 0 );
    }

    static DL_MATH_INL V2 make( const S p[N] )
    {
        return op::from_ptr<V2>( p );
    }

    template<typename S2, typename S3>
    static DL_MATH_INL V2 make( S2 x, S3 y )
    {
        V2 o = { ( S )x, ( S )y };
        return o;
    }

    template<typename S2>
    DL_EXPLICIT DL_MATH_INL operator VecT<N, S2>() const
    {
        return VecT<N, S2>::make( x, y );
    }

    DL_EXPLICIT DL_MATH_INL       operator V2() const { return *this; }
    DL_EXPLICIT DL_MATH_INL       operator P2() const { return P2 { x, y }; }
    DL_EXPLICIT DL_MATH_INL       operator V3() const { return V3 { x, y, ( S )0 }; }
    DL_EXPLICIT DL_MATH_INL       operator P3() const { return P3 { x, y, ( S )0 }; }
    DL_EXPLICIT DL_MATH_INL       operator V4() const { return V4 { x, y, ( S )0, ( S )0 }; }

    DL_MATH_INL const S&           operator[]( Dim i ) const { return math::elem( *this, i ); }

    DL_MATH_INL UInt64             hash() const { return dl::ds::hash( *this ); }
    DL_MATH_INL S                  aspect() const { return ( S )x / ( S )y; }
    DL_MATH_INL V2                 abs() const { return math::abs( *this ); }
    DL_MATH_INL V2                 unit() const { return math::unit( *this ); }
    DL_MATH_INL Bool               isUnit() const { return math::isUnit( *this ); }

    DL_MATH_INL S                  min() const { return math::min( *this ); }
    DL_MATH_INL S                  max() const { return math::max( *this ); }
    DL_MATH_INL S                  avg() const { return math::avg( *this ); }
    DL_MATH_INL V2                 round() const { return math::round( *this ); }
    DL_MATH_INL VecT<N, UInt32>    order() const { return math::order<N>( *this ); }
    DL_MATH_INL S                  sum() const { return math::sum( *this ); }
    DL_MATH_INL S                  dot( V2 t ) const { return math::dot( *this, t ); }
    DL_MATH_INL S                  normSq() const { return math::normSq( *this ); }
    DL_MATH_INL S                  norm() const { return math::norm( *this ); }
    DL_MATH_INL S                  cross( V2 t ) const { return math::cross( *this, t ); }

    DL_MATH_INL V2                 project( V2 n ) const { return math::project( *this, n ); }
    DL_MATH_INL V2                 reflect( V2 n ) const { return math::reflect( *this, n ); }

    template<typename S2> DL_MATH_INL V2 lerp( V2 v, S2 t ) const { return math::lerp( *this, v, t ); }
    template<typename S2> DL_MATH_INL V2 nlerp( V2 v, S2 t ) const { return math::nlerp( *this, v, t ); }
    template<typename S2> DL_MATH_INL V2 slerp( V2 v, S2 t ) const { return math::slerp( *this, v, t ); }
};

//=================================================================================================
// Pos2.
//=================================================================================================

template<typename S> struct PosT<2, S> DL_FINAL
{
    DL_MATH_SETUP_STRUCT( 2, S );

    union
    {
        struct { S x, y; };
        struct { S u, v; };
        struct { S a, b; };
        S m[N];
        S comp[N];
    };

    static const P2 zero;

    static DL_MATH_INL P2 make()
    {
        return make( 0, 0 );
    }

    static DL_MATH_INL P2 make( const S p[N] )
    {
        return op::from_ptr<P2>( p );
    }

    template<typename S2, typename S3>
    static DL_MATH_INL P2 make( S2 x, S3 y )
    {
        P2 o = { ( S )x, ( S )y };
        return o;
    }

    template<typename S2>
    DL_EXPLICIT DL_MATH_INL operator PosT<N, S2>() const
    {
        return PosT<N, S2>::make( x, y );
    }

    DL_EXPLICIT DL_MATH_INL       operator V2() const { return V2 { x, y }; }
    DL_EXPLICIT DL_MATH_INL       operator P2() const { return *this; }
    DL_EXPLICIT DL_MATH_INL       operator V3() const { return V3 { x, y, ( S )0 }; }
    DL_EXPLICIT DL_MATH_INL       operator P3() const { return P3 { x, y, ( S )0 }; }
    DL_EXPLICIT DL_MATH_INL       operator V4() const { return V4 { x, y, ( S )0, ( S )0 }; }

    DL_MATH_INL const S&           operator[]( Dim i ) const { return math::elem( *this, i ); }

    DL_MATH_INL UInt64             hash() const { return dl::ds::hash( *this ); }
    DL_MATH_INL S                  aspect() const { return ( S )x / ( S )y; }
    DL_MATH_INL P2                 abs() const { return math::abs( *this ); }
    DL_MATH_INL S                  min() const { return math::min( *this ); }
    DL_MATH_INL S                  max() const { return math::max( *this ); }
    DL_MATH_INL S                  avg() const { return math::avg( *this ); }
    DL_MATH_INL P2                 round() const { return math::round( *this ); }
    DL_MATH_INL VecT<N, UInt32>    order() const { return math::order<N>( *this ); }
    DL_MATH_INL S                  distance( P2 t ) const { return math::distance( *this, t ); }

    DL_MATH_INL P2                 project( P2 pl, V2 n ) const { return math::project( *this, pl, n ); }
    DL_MATH_INL P2                 reflect( P2 pl, V2 n ) const { return math::reflect( *this, pl, n ); }

    template<typename S2> DL_MATH_INL P2 lerp( P2 p, S2 t ) const { return math::lerp( *this, v, t ); }
    template<typename S2> DL_MATH_INL P2 nlerp( P2 p, S2 t ) const { return math::nlerp( *this, v, t ); }
    template<typename S2> DL_MATH_INL P2 slerp( P2 p, S2 t ) const { return math::slerp( *this, v, t ); }
};

//=================================================================================================
// Vec3.
//=================================================================================================

template<typename S> struct VecT<3, S> DL_FINAL
{
    DL_MATH_SETUP_STRUCT( 3, S );

    union
    {
        struct { S x, y, z; };
        struct { S u, v, w; };
        struct { S a, b, c; };
        S m[N];
        S comp[N];
        V2 v2;
        V2 xy;
        P2 p2;
    };

    static const V3 zero;
    static const V3 one;
    static const V3 unitX;
    static const V3 unitY;
    static const V3 unitZ;

    static DL_MATH_INL V3 make()
    {
        return make( 0, 0, 0 );
    }

    static DL_MATH_INL V3 make( const S p[N] )
    {
        return op::from_ptr<V3>( p );
    }

    template<typename S2, typename S3, typename S4>
    static DL_MATH_INL V3 make( S2 x, S3 y, S4 z )
    {
        V3 o = { ( S )x, ( S )y, ( S )z };
        return o;
    }

    template<typename S2>
    DL_EXPLICIT DL_MATH_INL operator VecT<N, S2>() const
    {
        return VecT<N, S2>::make( x, y, z );
    }

    DL_EXPLICIT DL_MATH_INL       operator V2() const { return v2; }
    DL_EXPLICIT DL_MATH_INL       operator P2() const { return p2; }
    DL_EXPLICIT DL_MATH_INL       operator V3() const { return *this; }
    DL_EXPLICIT DL_MATH_INL       operator P3() const { return P3 { x, y, z }; }
    DL_EXPLICIT DL_MATH_INL       operator C3() const { return C3 { x, y, z }; }
    DL_EXPLICIT DL_MATH_INL       operator V4() const { return V4 { x, y, z, ( S )0 }; }
    DL_EXPLICIT DL_MATH_INL       operator C4() const { return C4 { x, y, z, ( S )1 }; }

    DL_MATH_INL const S&           operator[]( Dim i ) const { return math::elem( *this, i ); }

    DL_MATH_INL UInt64             hash() const { return dl::ds::hash( *this ); }
    DL_MATH_INL V3                 abs() const { return math::abs( *this ); }
    DL_MATH_INL V3                 unit() const { return math::unit( *this ); }
    DL_MATH_INL Bool               isUnit() const { return math::isUnit( *this ); }

    DL_MATH_INL S                  min() const { return math::min( *this ); }
    DL_MATH_INL S                  max() const { return math::max( *this ); }
    DL_MATH_INL S                  avg() const { return math::avg( *this ); }
    DL_MATH_INL V3                 round() const { return math::round( *this ); }
    DL_MATH_INL VecT<N, UInt32>    order() const { return math::order<N>( *this ); }
    DL_MATH_INL S                  sum() const { return math::sum( *this ); }
    DL_MATH_INL S                  dot( V3 t ) const { return math::dot( *this, t ); }
    DL_MATH_INL S                  normSq() const { return math::normSq( *this ); }
    DL_MATH_INL S                  norm() const { return math::norm( *this ); }

    DL_MATH_INL V3                 cross( V3 t ) const { return math::cross( *this, t ); }
    DL_MATH_INL V3                 project( V3 n ) const { return math::project( *this, n ); }
    DL_MATH_INL V3                 reflect( V3 n ) const { return math::reflect( *this, n ); }

    template<typename S2> DL_MATH_INL V3 lerp( V3 v, S2 t ) const { return math::lerp( *this, v, t ); }
    template<typename S2> DL_MATH_INL V3 nlerp( V3 v, S2 t ) const { return math::nlerp( *this, v, t ); }
    template<typename S2> DL_MATH_INL V3 slerp( V3 v, S2 t ) const { return math::slerp( *this, v, t ); }
};

//=================================================================================================
// Pos3.
//=================================================================================================

template<typename S> struct PosT<3, S> DL_FINAL
{
    DL_MATH_SETUP_STRUCT( 3, S );

    union
    {
        struct { S x, y, z; };
        struct { S u, v, w; };
        struct { S a, b, c; };
        S m[N];
        S comp[N];
        V2 v2;
        V2 xy;
        P2 p2;
        V3 v3;
        V3 xyz;
    };

    static const P3 zero;

    static DL_MATH_INL P3 make()
    {
        return make( 0, 0, 0 );
    }

    static DL_MATH_INL P3 make( const S p[N] )
    {
        return op::from_ptr<P3>( p );
    }

    template<typename S2, typename S3, typename S4>
    static DL_MATH_INL P3 make( S2 x, S3 y, S4 z )
    {
        P3 o = { ( S )x, ( S )y, ( S )z };
        return o;
    }

    template<typename S2>
    DL_EXPLICIT DL_MATH_INL operator PosT<N, S2>() const
    {
        return PosT<N, S2>::make( x, y, z );
    }

    DL_EXPLICIT DL_MATH_INL       operator V2() const { return v2; }
    DL_EXPLICIT DL_MATH_INL       operator P2() const { return p2; }
    DL_EXPLICIT DL_MATH_INL       operator V3() const { return v3; }
    DL_EXPLICIT DL_MATH_INL       operator P3() const { return *this; }
    DL_EXPLICIT DL_MATH_INL       operator C3() const { return C3 { x, y, z }; }
    DL_EXPLICIT DL_MATH_INL       operator V4() const { return V4 { x, y, z, ( S )1 }; }
    DL_EXPLICIT DL_MATH_INL       operator C4() const { return C4 { x, y, z, ( S )1 }; }

    DL_MATH_INL const S&           operator[]( Dim i ) const { return math::elem( *this, i ); }

    DL_MATH_INL UInt64             hash() const { return dl::ds::hash( *this ); }
    DL_MATH_INL P3                 abs() const { return math::abs( *this ); }
    DL_MATH_INL S                  min() const { return math::min( *this ); }
    DL_MATH_INL S                  max() const { return math::max( *this ); }
    DL_MATH_INL S                  avg() const { return math::avg( *this ); }
    DL_MATH_INL P3                 round() const { return math::round( *this ); }
    DL_MATH_INL VecT<N, UInt32>    order() const { return math::order<N>( *this ); }
    DL_MATH_INL S                  distance( P3 t ) const { return math::distance( *this, t ); }

    DL_MATH_INL P3                 project( P3 pl, V3 n ) const { return math::project( *this, pl, n ); }
    DL_MATH_INL P3                 reflect( P3 pl, V3 n ) const { return math::reflect( *this, pl, n ); }

    template<typename S2> DL_MATH_INL P3 lerp( P3 p, S2 t ) const { return math::lerp( *this, v, t ); }
    template<typename S2> DL_MATH_INL P3 nlerp( P3 p, S2 t ) const { return math::nlerp( *this, v, t ); }
    template<typename S2> DL_MATH_INL P3 slerp( P3 p, S2 t ) const { return math::slerp( *this, v, t ); }
};

//=================================================================================================
// Vec4.
//=================================================================================================

template<typename S> struct VecT<4, S> DL_FINAL
{
    DL_MATH_SETUP_STRUCT( 4, S );

    union
    {
        struct { S x, y, z, w; };
        struct { S a, b, c, d; };
        S m[N];
        S comp[N];
        V2 v2;
        V2 xy;
        P2 p2;
        P3 p3;
        V3 v3;
        V3 xyz;
    };

    static const V4 zero;
    static const V4 one;
    static const V4 unitX;
    static const V4 unitY;
    static const V4 unitZ;
    static const V4 unitW;

    static DL_MATH_INL V4 make()
    {
        return make( 0, 0, 0, 0 );
    }

    static DL_MATH_INL V4 make( const S p[N] )
    {
        return op::from_ptr<V4>( p );
    }

    template<typename S2, typename S3, typename S4, typename S5>
    static DL_MATH_INL V4 make( S2 x, S3 y, S4 z, S5 w )
    {
        V4 o = { ( S )x, ( S )y, ( S )z, ( S )w };
        return o;
    }

    template<typename S2, typename S3, typename S4>
    static DL_MATH_INL V4 make( S2 x, S3 y, S4 z )
    {
        return make( x, y, z, 0 );
    }

    template<typename S2>
    DL_EXPLICIT DL_MATH_INL operator VecT<N, S2>() const
    {
        return VecT<N, S2>::make( x, y, z, w );
    }

    DL_EXPLICIT DL_MATH_INL       operator V2() const { return v2; }
    DL_EXPLICIT DL_MATH_INL       operator P2() const { return p2; }
    DL_EXPLICIT DL_MATH_INL       operator V3() const { return v3; }
    DL_EXPLICIT DL_MATH_INL       operator P3() const { return op::op_v4top3( *this ); }
    DL_EXPLICIT DL_MATH_INL       operator C3() const { return C3 { x, y, z }; }
    DL_EXPLICIT DL_MATH_INL       operator C4() const { return C4 { x, y, z, w }; }
    DL_EXPLICIT DL_MATH_INL       operator Q() const { return Q { x, y, z, w }; }

    DL_MATH_INL const S&           operator[]( Dim i ) const { return math::elem( *this, i ); }

    DL_MATH_INL UInt64             hash() const { return dl::ds::hash( *this ); }
    DL_MATH_INL V4                 abs() const { return math::abs( *this ); }
    DL_MATH_INL V4                 unit() const { return math::unit( *this ); }
    DL_MATH_INL Bool               isUnit() const { return math::isUnit( *this ); }

    DL_MATH_INL S                  min() const { return math::min( *this ); }
    DL_MATH_INL S                  max() const { return math::max( *this ); }
    DL_MATH_INL S                  avg() const { return math::avg( *this ); }
    DL_MATH_INL V4                 round() const { return math::round( *this ); }
    DL_MATH_INL VecT<N, UInt32>    order() const { return math::order<N>( *this ); }
    DL_MATH_INL S                  sum() const { return math::sum( *this ); }
    DL_MATH_INL S                  dot( V4 t ) const { return math::dot( *this, t ); }
    DL_MATH_INL S                  normSq() const { return math::normSq( *this ); }
    DL_MATH_INL S                  norm() const { return math::norm( *this ); }

    template<typename S2> DL_MATH_INL V4 lerp( V4 v, S2 t ) const { return math::lerp( *this, v, t ); }
    template<typename S2> DL_MATH_INL V4 nlerp( V4 v, S2 t ) const { return math::nlerp( *this, v, t ); }
    template<typename S2> DL_MATH_INL V4 slerp( V4 v, S2 t ) const { return math::slerp( *this, v, t ); }
};

//=================================================================================================
// Quaternion.
//=================================================================================================

template<typename S> struct QuatT DL_FINAL
{
    DL_MATH_SETUP_STRUCT( 4, S );

    union
    {
        struct { S x, y, z, w; };
        struct { S a, b, c, d; };
        S m[N];
        S comp[N];
    };

    static const Q zero;
    static const Q identity;

    static DL_MATH_INL Q make()
    {
        return make( 0, 0, 0, 1 );
    }

    static DL_MATH_INL Q make( const S p[N] )
    {
        return op::from_ptr<Q>( p );
    }

    template<typename S2, typename S3, typename S4, typename S5>
    static DL_MATH_INL Q make( S2 x, S3 y, S4 z, S5 w )
    {
        Q o = { ( S )x, ( S )y, ( S )z, ( S )w };
        return o;
    }

    template<typename S2, typename S3, typename S4>
    static DL_MATH_INL Q make( S2 x, S3 y, S4 z )
    {
        return make( x, y, z, 1 );
    }

    template<typename S2>
    static DL_MATH_INL Q make( V3 v, S2 s )
    {
        return make( v.x, v.y, v.z, s );
    }

    static DL_MATH_INL Q make( V3 v )
    {
        return make( v, 1 );
    }

    template<typename S2>
    DL_EXPLICIT DL_MATH_INL operator QuatT<S2>() const
    {
        return QuatT<S2>::make( x, y, z, w );
    }

    DL_EXPLICIT DL_MATH_INL       operator V4() const { return V4 { x, y, z, w }; }
    DL_EXPLICIT DL_MATH_INL       operator M3() const { return op::op_q2m<S, M3>( *this ); }
    DL_EXPLICIT DL_MATH_INL       operator M4() const { return op::op_q2m<S, M4>( *this ); }

    DL_MATH_INL const S&           operator[]( Dim i ) const { return math::elem( *this, i ); }

    DL_MATH_INL UInt64             hash() const { return dl::ds::hash( *this ); }
    DL_MATH_INL Q                  unit() const { return math::unit( *this ); }
    DL_MATH_INL Bool               isUnit() const { return math::isUnit( *this ); }

    DL_MATH_INL S                  min() const { return math::min( *this ); }
    DL_MATH_INL S                  max() const { return math::max( *this ); }
    DL_MATH_INL S                  avg() const { return math::avg( *this ); }
    DL_MATH_INL S                  sum() const { return math::sum( *this ); }
    DL_MATH_INL S                  dot( Q t ) const { return math::dot( *this, t ); }
    DL_MATH_INL S                  normSq() const { return math::normSq( *this ); }
    DL_MATH_INL S                  norm() const { return math::norm( *this ); }

    DL_MATH_INL S                  scalar() const { return math::scalar( *this ); }
    DL_MATH_INL V3                 vector() const { return math::vector( *this ); }

    DL_MATH_INL Q                  conjugate() const { return math::conjugate( *this ); }
    DL_MATH_INL Q                  inverse() const { return math::inverse( *this ); }
    DL_MATH_INL Q                  product( Q q ) const { return math::product( *this, q ); }

    static DL_MATH_INL Q           fromAA( V3 axis, S angle ) { return math::quatFromAA( axis, angle ); }
    DL_MATH_INL void               toAA( V3& axis, S& angle ) const { math::quattoAA( *this, axis, angle ); }

    template<typename S2> DL_MATH_INL Q lerp( Q q, S2 t ) const { return math::lerp( *this, q, t ); }
    template<typename S2> DL_MATH_INL Q nlerp( Q q, S2 t ) const { return math::nlerp( *this, q, t ); }
    template<typename S2> DL_MATH_INL Q slerp( Q q, S2 t ) const { return math::slerp( *this, q, t ); }
};

//=================================================================================================
// Matrix 3x3.
//=================================================================================================

template<typename S> struct MatT<3, S> DL_FINAL
{
    DL_MATH_SETUP_STRUCT( 3, S );

    typedef M3 M;
    typedef V3 V;

    union
    {
        struct { V3 c0, c1, c2; };
        struct { V3 v0, v1, v2; };
        struct { V3 xaxis, yaxis, zaxis; };
        struct { V3 tangent, bitangent, normal; };
        struct { S m00, m01, m02, m10, m11, m12, m20, m21, m22; };
        struct { S A11, A12, A13, A21, A22, A23, A31, A32, A33; };
        S m[N*N];
        V3 comp[N];
    };

    static const M3 zero;
    static const M3 identity;

    static DL_MATH_INL M3 make()
    {
        return make( V3::unitX, V3::unitY, V3::unitZ );
    }

    static DL_MATH_INL M3 make( const S p[N] )
    {
        return op::from_ptr<M3>( p );
    }

    template<typename S2>
    static DL_MATH_INL M3 make(
    S2 m00, S2 m01, S2 m02,
    S2 m10, S2 m11, S2 m12,
    S2 m20, S2 m21, S2 m22 )
    {
        M3 o;
        o.m00 = ( S )m00;
        o.m01 = ( S )m01;
        o.m02 = ( S )m02;
        o.m10 = ( S )m10;
        o.m11 = ( S )m11;
        o.m12 = ( S )m12;
        o.m20 = ( S )m20;
        o.m21 = ( S )m21;
        o.m22 = ( S )m22;
        return o;
    }

    static DL_MATH_INL M3 make( V3 x, V3 y, V3 z )
    {
        return make( x.x, x.y, x.z, y.x, y.y, y.z, z.x, z.y, z.z );
    }

    template<typename T>
    static DL_MATH_INL M3 make( T x, T y, T z )
    {
        return make( ( V3 )x, ( V3 )y, ( V3 )z );
    }

    template<typename Rot, typename Sca>
    static DL_MATH_INL M3 make( Rot rotation, Sca scale )
    {
        M3 rot = ( M3 )rotation;
        V3 sca = ( V3 )scale;
        return make(
               rot.m00*sca.x, rot.m01*sca.x, rot.m02*sca.x,
               rot.m10*sca.y, rot.m11*sca.y, rot.m12*sca.y,
               rot.m20*sca.z, rot.m21*sca.z, rot.m22*sca.z
               );
    }

    template<typename S2>
    DL_EXPLICIT DL_MATH_INL operator MatT<3, S2>() const
    {
        return MatT<3, S2>::make( m00, m01, m02, m10, m11, m12, m20, m21, m22 );
    }

    template<typename S2>
    DL_EXPLICIT DL_MATH_INL operator MatT<4, S2>() const
    {
        return MatT<4, S2>::make( m00, m01, m02, ( S )0, m10, m11, m12, ( S )0, m20, m21, m22, ( S )0, ( S )0, ( S )0, ( S )0, ( S )1 );
    }

    DL_EXPLICIT DL_MATH_INL       operator Q()  const { return op::op_m2q<S, Q>( *this ); }
    DL_EXPLICIT DL_MATH_INL       operator XF() const { return XF::make( *this ); }

    DL_MATH_INL const V3&          operator[]( Dim i ) const { return math::elem( *this, i ); }

    DL_MATH_INL UInt64             hash() const { return dl::ds::hash( *this ); }
    DL_MATH_INL Bool               isUnit() const { return math::isUnit( *this ); }
    DL_MATH_INL Bool               isZero() const { return math::isZero( *this ); }
    DL_MATH_INL Bool               isIdentity() const { return math::isIdentity( *this ); }
    DL_MATH_INL Bool               isSingular() const { return math::isSingular( *this ); }
    DL_MATH_INL Bool               isReflection() const { return math::isReflection( *this ); }
    DL_MATH_INL Bool               isNormalized() const { return math::isNormalized( *this ); }
    DL_MATH_INL Bool               isOrtho() const { return math::isOrtho( *this ); }
    DL_MATH_INL Bool               isOrthoNormal() const { return math::isOrthoNormal( *this ); }

    DL_MATH_INL S                  min() const { return math::min( *this ); }
    DL_MATH_INL S                  max() const { return math::max( *this ); }
    DL_MATH_INL VecT<N, UInt32>    order() const { return math::order<N>( *this ); }
    DL_MATH_INL M3                 unit() const { return math::unit( *this ); }
    DL_MATH_INL S                  trace() const { return math::trace( *this ); }
    DL_MATH_INL V3                 diagonal() const { return math::diagonal( *this ); }
    DL_MATH_INL V3                 scale() const { return math::scale( *this ); }
    DL_MATH_INL M3                 rotation() const { return math::rotation( *this ); }
    DL_MATH_INL V3                 eulers() const { return math::eulers( *this ); }
    DL_MATH_INL M3                 transpose() const { return math::transpose( *this ); }
    DL_MATH_INL S                  determinant() const { return math::determinant( *this ); }
    DL_MATH_INL M3                 inverse() const { return math::inverse( *this ); }
    DL_MATH_INL M3                 inverseTranspose() const { return math::inverseTranspose( *this ); }

    DL_MATH_INL M3                 nlerp( const M3& other, S t ) { return math::nlerp( *this, other, t ); }
    DL_MATH_INL M3                 slerp( const M3& other, S t ) { return math::slerp( *this, other, t ); }
    DL_MATH_INL M3                 fnlerp( const M3& other, S t ) { return math::fnlerp( *this, other, t ); }
    DL_MATH_INL M3                 onlerp( const M3& other, S t ) { return math::onlerp( *this, other, t ); }

    template<typename S2> static DL_MATH_INL M3 makeScale( S2 x, S2 y, S2 z ) { return math::makeScale<N>( ( S )x, ( S )y, ( S )z ); }
    template<typename Vec> static DL_MATH_INL M3 makeScale( Vec v ) { return makeScale( ( S )v.x, ( S )v.y, ( S )v.z ); }
    template<typename S2> static DL_MATH_INL M3 makeRotationX( S2 r ) { return math::makeRotationX<N>( ( S )r ); }
    template<typename S2> static DL_MATH_INL M3 makeRotationY( S2 r ) { return math::makeRotationY<N>( ( S )r ); }
    template<typename S2> static DL_MATH_INL M3 makeRotationZ( S2 r ) { return math::makeRotationZ<N>( ( S )r ); }
    template<typename S2> static DL_MATH_INL M3 makeRotation( S2 x, S2 y, S2 z, const char* order = "xyz" ) { return math::makeRotation<N>( ( S )x, ( S )y, ( S )z, order ); }
};

//=================================================================================================
// Matrix 4x4.
//=================================================================================================

template<typename S> struct MatT<4, S> DL_FINAL
{
    DL_MATH_SETUP_STRUCT( 4, S );

    typedef M4 M;
    typedef V4 V;

    union
    {
        struct { V4 c0, c1, c2, c3; };
        struct { V4 v0, v1, v2, v3; };
        struct { V4 xaxis, yaxis, zaxis, position; };
        struct { S m00, m01, m02, m03, m10, m11, m12, m13, m20, m21, m22, m23, m30, m31, m32, m33; };
        struct { S A11, A12, A13, A14, A21, A22, A23, A24, A31, A32, A33, A34, A41, A42, A43, A44; };
        S m[N*N];
        V4 comp[N];
    };

    static const M4 zero;
    static const M4 identity;

    static DL_MATH_INL M4 make()
    {
        return make( V4::unitX, V4::unitY, V4::unitZ, V4::unitW );
    }

    static DL_MATH_INL M4 make( const S p[N] )
    {
        return op::from_ptr<M4>( p );
    }

    template<typename S2>
    static DL_MATH_INL M4 make(
    S2 m00, S2 m01, S2 m02, S2 m03,
    S2 m10, S2 m11, S2 m12, S2 m13,
    S2 m20, S2 m21, S2 m22, S2 m23,
    S2 m30, S2 m31, S2 m32, S2 m33 )
    {
        M4 o;
        o.m00 = ( S )m00;
        o.m01 = ( S )m01;
        o.m02 = ( S )m02;
        o.m03 = ( S )m03;
        o.m10 = ( S )m10;
        o.m11 = ( S )m11;
        o.m12 = ( S )m12;
        o.m13 = ( S )m13;
        o.m20 = ( S )m20;
        o.m21 = ( S )m21;
        o.m22 = ( S )m22;
        o.m23 = ( S )m23;
        o.m30 = ( S )m30;
        o.m31 = ( S )m31;
        o.m32 = ( S )m32;
        o.m33 = ( S )m33;
        return o;
    }

    static DL_MATH_INL M4 make( V4 x, V4 y, V4 z, V4 t )
    {
        return make( x.x, x.y, x.z, x.w, y.x, y.y, y.z, y.w, z.x, z.y, z.z, z.w, t.x, t.y, t.z, t.w );
    }

    static DL_MATH_INL M4 make( V3 x, V3 y, V3 z, V3 t = V3::zero )
    {
        return make( ( V4 )x, ( V4 )y, ( V4 )z, V4::make( t.x, t.y, t.z, 1 ) );
    }

    template<typename Pos, typename Rot, typename Sca>
    static DL_MATH_INL M4 make( Pos position, Rot rotation, Sca scale )
    {
        P3 pos = ( P3 )position;
        M3 rot = ( M3 )rotation;
        V3 sca = ( V3 )scale;
        return make(
               rot.m00*sca.x, rot.m01*sca.x, rot.m02*sca.x, ( S )0,
               rot.m10*sca.y, rot.m11*sca.y, rot.m12*sca.y, ( S )0,
               rot.m20*sca.z, rot.m21*sca.z, rot.m22*sca.z, ( S )0,
               pos.x, pos.y, pos.z, ( S )1
               );
    }

    DL_EXPLICIT DL_MATH_INL       operator Q()  const { return op::op_m2q<S, Q>( *this ); }
    DL_EXPLICIT DL_MATH_INL       operator XF() const { return XF::make( *this ); }

    template<typename S2>
    DL_EXPLICIT DL_MATH_INL operator MatT<4, S2>() const
    {
        return MatT<4, S2>::make( m00, m01, m02, m03, m10, m11, m12, m13, m20, m21, m22, m23, m30, m31, m32, m33 );
    }

    template<typename S2>
    DL_EXPLICIT DL_MATH_INL operator MatT<3, S2>() const
    {
        return MatT<3, S2>::make( m00, m01, m02, m10, m11, m12, m20, m21, m22 );
    }

    DL_MATH_INL const V4&          operator[]( Dim i ) const { return math::elem( *this, i ); }

    DL_MATH_INL UInt64             hash() const { return dl::ds::hash( *this ); }
    DL_MATH_INL Bool               isUnit() const { return math::isUnit( *this ); }
    DL_MATH_INL Bool               isZero() const { return math::isZero( *this ); }
    DL_MATH_INL Bool               isIdentity() const { return math::isIdentity( *this ); }
    DL_MATH_INL Bool               isSingular() const { return math::isSingular( *this ); }
    DL_MATH_INL Bool               isReflection() const { return math::isReflection( *this ); }
    DL_MATH_INL Bool               isNormalized() const { return math::isNormalized( *this ); }
    DL_MATH_INL Bool               isOrtho() const { return math::isOrtho( *this ); }
    DL_MATH_INL Bool               isOrthoNormal() const { return math::isOrthoNormal( *this ); }

    DL_MATH_INL S                  min() const { return math::min( *this ); }
    DL_MATH_INL S                  max() const { return math::max( *this ); }
    DL_MATH_INL VecT<N, UInt32>    order() const { return math::order<N>( *this ); }
    DL_MATH_INL M4                 unit() const { return math::unit( *this ); }
    DL_MATH_INL S                  trace() const { return math::trace( *this ); }
    DL_MATH_INL V4                 diagonal() const { return math::diagonal( *this ); }
    DL_MATH_INL V3                 scale() const { return math::scale( *this ); }
    DL_MATH_INL M3                 rotation() const { return math::rotation( *this ); }
    DL_MATH_INL V3                 eulers() const { return math::eulers( *this ); }
    DL_MATH_INL M4                 transpose() const { return math::transpose( *this ); }
    DL_MATH_INL S                  determinant() const { return math::determinant( *this ); }
    DL_MATH_INL M4                 inverse() const { return math::inverse( *this ); }
    DL_MATH_INL M4                 inverseTranspose() const { return math::inverseTranspose( *this ); }

    DL_MATH_INL Bool               isAffine() const { return math::isAffine( *this ); }
    DL_MATH_INL Bool               isTranslation() const { return math::isTranslation( *this ); }
    DL_MATH_INL V3                 translation() const { return math::translation( *this ); }

    DL_MATH_INL M4                 nlerp( const M4& other, S t ) { return math::nlerp( *this, other, t ); }
    DL_MATH_INL M4                 slerp( const M4& other, S t ) { return math::slerp( *this, other, t ); }
    DL_MATH_INL M4                 fnlerp( const M4& other, S t ) { return math::fnlerp( *this, other, t ); }
    DL_MATH_INL M4                 onlerp( const M4& other, S t ) { return math::onlerp( *this, other, t ); }

    template<typename S2> static DL_MATH_INL M4 makeScale( S2 x, S2 y, S2 z ) { return math::makeScale<N>( ( S )x, ( S )y, ( S )z ); }
    template<typename Vec> static DL_MATH_INL M4 makeScale( Vec v ) { return makeScale( ( S )v.x, ( S )v.y, ( S )v.z ); }
    template<typename S2> static DL_MATH_INL M4 makeRotationX( S2 r ) { return math::makeRotationX<N>( ( S )r ); }
    template<typename S2> static DL_MATH_INL M4 makeRotationY( S2 r ) { return math::makeRotationY<N>( ( S )r ); }
    template<typename S2> static DL_MATH_INL M4 makeRotationZ( S2 r ) { return math::makeRotationZ<N>( ( S )r ); }
    template<typename S2> static DL_MATH_INL M4 makeRotation( S2 x, S2 y, S2 z, const char* order = "xyz" ) { return math::makeRotation<N>( ( S )x, ( S )y, ( S )z, order ); }
    template<typename S2> static DL_MATH_INL M4 makeTranslation( S2 x, S2 y, S2 z ) { return math::makeTranslation<S>( ( S )x, ( S )y, ( S )z ); }
};

//=================================================================================================
// Xform.
//=================================================================================================

template<typename S> struct XformT DL_FINAL
{
    DL_MATH_MAKE_TYPEDEFS( S )

    P3 position;
    Q  rotation;
    V3 scale;

    static const XF identity;

    static DL_MATH_INL XF make()
    {
        return XF::identity;
    }

    template<typename Pos, typename Rot, typename Sca>
    static DL_MATH_INL XF make( Pos position, Rot rotation, Sca scale )
    {
        XF o;
        o.position = ( P3 )position;
        o.rotation = ( Q )rotation;
        o.scale = ( V3 )scale;
        return o;
    }

    //
    // NOTE: decomposition will fail for matrices containing shear, or which have had rotations
    // applied after scaling. If you cannot guarantee that these conditions are met, it will be
    // better to leave your transformation in matrix form.
    //
    static DL_MATH_INL XF          make( const M3& m ) { return make( P3::zero, m.rotation(), m.scale() ); }
    static DL_MATH_INL XF          make( const M4& m ) { return make( m.translation(), m.rotation(), m.scale() ); }

    DL_EXPLICIT DL_MATH_INL       operator M3() const { return M3::make( rotation, scale ); }
    DL_EXPLICIT DL_MATH_INL       operator M4() const { return M4::make( position, rotation, scale ); }

    DL_MATH_INL XF                 nlerp( const XF& other, S t ) { return math::nlerp( *this, other, t ); }
    DL_MATH_INL XF                 slerp( const XF& other, S t ) { return math::slerp( *this, other, t ); }
    DL_MATH_INL XF                 fnlerp( const XF& other, S t ) { return math::fnlerp( *this, other, t ); }
    DL_MATH_INL XF                 onlerp( const XF& other, S t ) { return math::onlerp( *this, other, t ); }
};

//=================================================================================================
// AABB.
//=================================================================================================

template<typename S> struct AabbT DL_FINAL
{
    DL_MATH_MAKE_TYPEDEFS( S )

    P3 min;
    P3 max;

    static const AABB identity;

    static DL_MATH_INL AABB make()
    {
        return AABB::identity;
    }

    template<typename T0, typename T1>
    static DL_MATH_INL AABB make( T0 min, T1 max )
    {
        AABB o;
        o.min = ( P3 )min;
        o.max = ( P3 )max;
        return o;
    }
};

//=================================================================================================
// OBB.
//=================================================================================================

template<typename S> struct ObbT DL_FINAL
{
    DL_MATH_MAKE_TYPEDEFS( S )

    M4 frame;
    V3 size;

    static const OBB identity;

    static DL_MATH_INL OBB make()
    {
        return OBB::identity;
    }

    template<typename Mat, typename Vec>
    static DL_MATH_INL OBB make( Mat frame, Vec size )
    {
        OBB o;
        o.frame = ( M4 )frame;
        o.size = ( V3 )size;
        return o;
    }
};

//=================================================================================================
// Rgb.
//=================================================================================================

template<typename S> struct RgbT DL_FINAL
{
    DL_MATH_SETUP_STRUCT( 3, S );

    union
    {
        struct { S r, g, b; };
        struct { S x, y, z; };
        S m[N];
        S comp[N];
        V3 v3;
        V3 xyz;
        P3 p3;
    };

    static const C3 black;
    static const C3 white;
    static const C3 grey;
    static const C3 red;
    static const C3 green;
    static const C3 blue;
    static const C3 yellow;
    static const C3 cyan;
    static const C3 magenta;

    static DL_MATH_INL C3 make()
    {
        return make( 0, 0, 0 );
    }

    static DL_MATH_INL C3 make( const S p[N] )
    {
        return make( p[0], p[1], p[2] );
    }

    template<typename S2, typename S3, typename S4>
    static DL_MATH_INL C3 make( S2 r, S3 g, S4 b )
    {
        if ( ( S )r > ( S )1 || ( S )g > ( S )1 || ( S )b > ( S )1 )
        {
            C3 o;
            o.r = ( S )r/( S )255;
            o.g = ( S )g/( S )255;
            o.b = ( S )b/( S )255;
            return o;
        }
        return C3 { ( S )r, ( S )g, ( S )b };
    }

    template<typename S2>
    DL_EXPLICIT DL_MATH_INL operator RgbT<S2>() const
    {
        return RgbT<S2>::make( r, g, b );
    }

    DL_EXPLICIT DL_MATH_INL       operator V3() const { return v3; }
    DL_EXPLICIT DL_MATH_INL       operator P3() const { return p3; }
    DL_EXPLICIT DL_MATH_INL       operator V4() const { return V4 { r, g, b, ( S )0 }; }
    DL_EXPLICIT DL_MATH_INL       operator C4() const { return C4 { r, g, b, ( S )1 }; }
    DL_EXPLICIT DL_MATH_INL       operator HSV() const { return math::toHsv( *this ); }
    DL_EXPLICIT DL_MATH_INL       operator HSL() const { return math::toHsl( *this ); }

    DL_EXPLICIT DL_MATH_INL       operator Rgb8() const;
    DL_EXPLICIT DL_MATH_INL       operator Rgba8() const;

    DL_MATH_INL const S&           operator[]( Dim i ) const { return math::elem( *this, i ); }

    DL_MATH_INL UInt64             hash() const { return dl::ds::hash( *this ); }
    DL_MATH_INL C3                 abs() const { return math::abs( *this ); }
    DL_MATH_INL S                  min() const { return math::min( *this ); }
    DL_MATH_INL S                  max() const { return math::max( *this ); }
    DL_MATH_INL S                  avg() const { return math::avg( *this ); }
    DL_MATH_INL C3                 round() const { return math::round( *this ); }
    DL_MATH_INL VecT<N, UInt32>    order() const { return math::order<N>( *this ); }
    DL_MATH_INL S                  sum() const { return math::sum( *this ); }

    DL_MATH_INL C3 inv() const
    {
        return C3
        {
            ( S )1 - r,
            ( S )1 - g,
            ( S )1 - b
        };
    }
};

//=================================================================================================
// Rgb8.
//=================================================================================================

template<> struct RgbT<UInt8> DL_FINAL
{
    DL_MATH_SETUP_STRUCT_WITH_S( 3, UInt8 );

    union
    {
        struct { S r, g, b; };
        struct { S x, y, z; };
        S m[N];
        S comp[N];
        V3 v3;
        V3 xyz;
    };

    static DL_MATH_INL C3 make()
    {
        return make( ( S )0, ( S )0, ( S )0 );
    }

    static DL_MATH_INL C3 make( const S p[N] )
    {
        return op::from_ptr<C3>( p );
    }

    static DL_MATH_INL C3 make( S r, S g, S b )
    {
        C3 o;
        o.r = clamp<S>( r, 0, 255 );
        o.g = clamp<S>( g, 0, 255 );
        o.b = clamp<S>( b, 0, 255 );
        return o;
    }

    static C3 make( Double r, Double g, Double b );
    static C3 make( Float r, Float g, Float b );

    template<typename S2>
    static DL_MATH_INL C3 make( S2 r, S2 g, S2 b )
    {
        return make( ( S ) r, ( S ) g, ( S ) b );
    }

    DL_EXPLICIT DL_MATH_INL       operator Rgbf() const;
    DL_EXPLICIT DL_MATH_INL       operator Rgbd() const;

    DL_EXPLICIT DL_MATH_INL       operator Rgbaf() const;
    DL_EXPLICIT DL_MATH_INL       operator Rgbad() const;
    DL_EXPLICIT DL_MATH_INL       operator Rgba8() const;

    DL_EXPLICIT DL_MATH_INL       operator Hsvf() const;
    DL_EXPLICIT DL_MATH_INL       operator Hsvd() const;

    DL_EXPLICIT DL_MATH_INL       operator Hslf() const;
    DL_EXPLICIT DL_MATH_INL       operator Hsld() const;

    DL_EXPLICIT DL_MATH_INL       operator Argb8() const;
    DL_EXPLICIT DL_MATH_INL       operator ColorRef() const;

    DL_MATH_INL const S&           operator[]( Dim i ) const { return math::elem( *this, i ); }

    DL_MATH_INL UInt64             hash() const { return dl::ds::hash( *this ); }
    DL_MATH_INL C3                 abs() const { return math::abs( *this ); }
    DL_MATH_INL S                  min() const { return math::min( *this ); }
    DL_MATH_INL S                  max() const { return math::max( *this ); }
    DL_MATH_INL S                  avg() const { return math::avg( *this ); }
    DL_MATH_INL C3                 round() const { return math::round( *this ); }
    DL_MATH_INL VecT<N, UInt32>    order() const { return math::order<N>( *this ); }
    DL_MATH_INL S                  sum() const { return math::sum( *this ); }

    DL_MATH_INL C3 inv() const
    {
        return C3
        {
            ( S )( 255 - r ),
            ( S )( 255 - g ),
            ( S )( 255 - b )
        };
    }
};

DL_MATH_INL RgbT<UInt8> RgbT<UInt8>::make( Double r, Double g, Double b )
{
    return RgbT<UInt8>::make(
           math::round<UInt8>( r*255.0 ),
           math::round<UInt8>( g*255.0 ),
           math::round<UInt8>( b*255.0 )
           );
}

DL_MATH_INL RgbT<UInt8> RgbT<UInt8>::make( Float r, Float g, Float b )
{
    return RgbT<UInt8>::make(
           math::round<UInt8>( r*255.0f ),
           math::round<UInt8>( g*255.0f ),
           math::round<UInt8>( b*255.0f )
           );
}

//=================================================================================================
// Rgba.
//=================================================================================================

template<typename S> struct RgbaT DL_FINAL
{
    DL_MATH_SETUP_STRUCT( 4, S );

    union
    {
        struct { S r, g, b, a; };
        struct { S x, y, z, w; };
        S m[N];
        S comp[N];
        C3 c3;
        C3 rgb;
        V3 v3;
        V3 xyz;
        P3 p3;
        V4 v4;
        V4 xyzw;
    };

    static const C4 black;
    static const C4 white;
    static const C4 grey;
    static const C4 red;
    static const C4 green;
    static const C4 blue;
    static const C4 yellow;
    static const C4 cyan;
    static const C4 magenta;

    static DL_MATH_INL C4 make()
    {
        return make( 0, 0, 0, 1 );
    }

    static DL_MATH_INL C4 make( const S p[N] )
    {
        return make( p[0], p[1], p[2], p[3] );
    }

    static DL_MATH_INL C4 make( S r, S g, S b, S a )
    {
        if ( ( S )r > ( S )1 || ( S )g > ( S )1 || ( S )b > ( S )1 || ( S )a > ( S )1 )
        {
            C4 o;
            o.r = ( S )r/( S )255;
            o.g = ( S )g/( S )255;
            o.b = ( S )b/( S )255;
            o.a = ( S )a/( S )255;
            return o;
        }
        return C4 { ( S )r, ( S )g, ( S )b, ( S )a };
    }

    template<typename S2, typename S3, typename S4, typename S5>
    static DL_MATH_INL C4 make( S2 r, S3 g, S4 b, S5 a )
    {
        return make( ( S )( r ), ( S )( g ), ( S )( b ), ( S )( a ) );
    }

    template<typename S2, typename S3, typename S4>
    static DL_MATH_INL C4 make( S2 r, S3 g, S4 b )
    {
        return make( r, g, b, 1 );
    }

    template<typename S2>
    static DL_MATH_INL C4 make( C3 c, S2 s )
    {
        return make( c.r, c.g, c.b, s );
    }

    static DL_MATH_INL C4 make( C3 c )
    {
        return make( c.r, c.g, c.b );
    }

    template<typename S2>
    DL_EXPLICIT DL_MATH_INL operator RgbaT<S2>() const
    {
        return RgbaT<S2>::make( r, g, b, a );
    }

    DL_EXPLICIT DL_MATH_INL       operator C3() const { return c3; }
    DL_EXPLICIT DL_MATH_INL       operator V3() const { return v3; }
    DL_EXPLICIT DL_MATH_INL       operator P3() const { return p3; }
    DL_EXPLICIT DL_MATH_INL       operator V4() const { return v4; }
    DL_EXPLICIT DL_MATH_INL       operator HSV() const { return math::toHsv( *this ); }
    DL_EXPLICIT DL_MATH_INL       operator HSL() const { return math::toHsl( *this ); }

    DL_EXPLICIT DL_MATH_INL       operator Rgb8() const;
    DL_EXPLICIT DL_MATH_INL       operator Rgba8() const;

    DL_MATH_INL const S&           operator[]( Dim i ) const { return math::elem( *this, i ); }

    DL_MATH_INL UInt64             hash() const { return dl::ds::hash( *this ); }
    DL_MATH_INL C4                 abs() const { return math::abs( *this ); }
    DL_MATH_INL S                  min() const { return math::min( *this ); }
    DL_MATH_INL S                  max() const { return math::max( *this ); }
    DL_MATH_INL S                  avg() const { return math::avg( *this ); }
    DL_MATH_INL C4                 round() const { return math::round( *this ); }
    DL_MATH_INL VecT<N, UInt32>    order() const { return math::order<N>( *this ); }
    DL_MATH_INL S                  sum() const { return math::sum( *this ); }
    
    DL_MATH_INL C4 inv( bool invAlpha = true ) const
    {
        return C4
        {
            ( S )1 - r,
            ( S )1 - g,
            ( S )1 - b,
            invAlpha ? ( S )1 - a : a
        };
    }
};

//=================================================================================================
// Rgba8.
//=================================================================================================

template<> struct RgbaT<UInt8> DL_FINAL
{
    DL_MATH_SETUP_STRUCT_WITH_S( 4, UInt8 );

    union
    {
        struct { S r, g, b, a; };
        struct { S x, y, z, w; };
        S m[N];
        S comp[N];
        C3 c3;
        C3 rgb;
        V3 v3;
        V3 xyz;
        V4 v4;
        V4 xyzw;
    };

    static DL_MATH_INL C4 make()
    {
        return make( ( S )0, ( S )0, ( S )0, ( S ) 0 );
    }

    static DL_MATH_INL C4 make( const S p[N] )
    {
        return op::from_ptr<C4>( p );
    }

    static DL_MATH_INL C4 make( S r, S g, S b, S a )
    {
        C4 o;
        o.r = clamp<S>( r, 0, 255 );
        o.g = clamp<S>( g, 0, 255 );
        o.b = clamp<S>( b, 0, 255 );
        o.a = clamp<S>( a, 0, 255 );
        return o;
    }

    template<typename S2>
    static DL_MATH_INL C4 make( S2 r, S2 g, S2 b, S2 a )
    {
        return make( ( S )r, ( S )g, ( S )b, ( S )a );
    }

    static C4 make( Double r, Double g, Double b, Double a );
    static C4 make( Float r, Float g, Float b, Float a );

    template<typename S2>
    static DL_MATH_INL C4 make( S2 r, S2 g, S2 b )
    {
        return make( r, g, b, ( S2 )1 );
    }

    DL_EXPLICIT DL_MATH_INL       operator Rgbf() const;
    DL_EXPLICIT DL_MATH_INL       operator Rgbd() const;
    DL_EXPLICIT DL_MATH_INL       operator Rgb8() const;

    DL_EXPLICIT DL_MATH_INL       operator Rgbaf() const;
    DL_EXPLICIT DL_MATH_INL       operator Rgbad() const;

    DL_EXPLICIT DL_MATH_INL       operator Hsvf() const;
    DL_EXPLICIT DL_MATH_INL       operator Hsvd() const;

    DL_EXPLICIT DL_MATH_INL       operator Hslf() const;
    DL_EXPLICIT DL_MATH_INL       operator Hsld() const;

    DL_EXPLICIT DL_MATH_INL       operator Argb8() const;
    DL_EXPLICIT DL_MATH_INL       operator ColorRef() const;

    DL_MATH_INL const S&           operator[]( Dim i ) const { return math::elem( *this, i ); }

    DL_MATH_INL UInt64             hash() const { return dl::ds::hash( *this ); }
    DL_MATH_INL C4                 abs() const { return math::abs( *this ); }
    DL_MATH_INL S                  min() const { return math::min( *this ); }
    DL_MATH_INL S                  max() const { return math::max( *this ); }
    DL_MATH_INL S                  avg() const { return math::avg( *this ); }
    DL_MATH_INL C4                 round() const { return math::round( *this ); }
    DL_MATH_INL VecT<N, UInt32>    order() const { return math::order<N>( *this ); }
    DL_MATH_INL S                  sum() const { return math::sum( *this ); }

    DL_MATH_INL C4 inv( bool invAlpha = true ) const
    {
        return C4
        {
            ( S )( 255 - r ),
            ( S )( 255 - g ),
            ( S )( 255 - b ),
            ( S )( invAlpha ? ( S )255 - a : a )
        };
    }
};

DL_MATH_INL RgbaT<UInt8> RgbaT<UInt8>::make( Double r, Double g, Double b, Double a )
{
    return RgbaT<UInt8>::make(
           math::round<UInt8>( r*255.1 ),
           math::round<UInt8>( g*255.1 ),
           math::round<UInt8>( b*255.1 ),
           math::round<UInt8>( a*255.1 )
           );
}

DL_MATH_INL RgbaT<UInt8> RgbaT<UInt8>::make( Float r, Float g, Float b, Float a )
{
    return RgbaT<UInt8>::make(
           math::round<UInt8>( r*255.1f ),
           math::round<UInt8>( g*255.1f ),
           math::round<UInt8>( b*255.1f ),
           math::round<UInt8>( a*255.1f )
           );
}

//=================================================================================================
// Hsv.
//=================================================================================================

template<typename S> struct HsvT DL_FINAL
{
    DL_MATH_SETUP_STRUCT( 3, S );

    union
    {
        struct { S h, s, v; };
        struct { S x, y, z; };
        S m[N];
        S comp[N];
        V3 v3;
    };

    static DL_MATH_INL HSV make()
    {
        return make( 0, 0, 0 );
    }

    static DL_MATH_INL HSV make( const S p[N] )
    {
        return op::from_ptr<HSV>( p );
    }

    static DL_MATH_INL HSV make( S h, S s, S v )
    {
        HSV o;
        o.h = h;
        o.s = s;
        o.v = v;
        return o;
    }

    template<typename S2, typename S3, typename S4>
    static DL_MATH_INL HSV make( S2 h, S3 s, S4 v )
    {
        return make( ( S ) h, ( S ) s, ( S ) v );
    }

    template<typename S2>
    DL_EXPLICIT DL_MATH_INL operator HsvT<S2>() const
    {
        return HsvT<S2>::make( h, s, v );
    }

    DL_EXPLICIT DL_MATH_INL       operator V3() const { return v3; }
    DL_EXPLICIT DL_MATH_INL       operator C3() const { return math::toRgb( *this ); }
    DL_EXPLICIT DL_MATH_INL       operator C4() const { return math::toRgba( *this ); }

    DL_MATH_INL const S&           operator[]( Dim i ) const { return math::elem( *this, i ); }

    DL_MATH_INL UInt64             hash() const { return dl::ds::hash( *this ); }
    DL_MATH_INL HSV                abs() const { return math::abs( *this ); }
    DL_MATH_INL S                  min() const { return math::min( *this ); }
    DL_MATH_INL S                  max() const { return math::max( *this ); }
    DL_MATH_INL S                  avg() const { return math::avg( *this ); }
    DL_MATH_INL VecT<N, UInt32>    order() const { return math::order<N>( *this ); }
    DL_MATH_INL S                  sum() const { return math::sum( *this ); }
};

//=================================================================================================
// Hsl.
//=================================================================================================

template<typename S> struct HslT DL_FINAL
{
    DL_MATH_SETUP_STRUCT( 3, S );

    union
    {
        struct { S h, s, l; };
        struct { S x, y, z; };
        S m[N];
        S comp[N];
        V3 v3;
    };

    static DL_MATH_INL HSL make()
    {
        return make( 0, 0, 0 );
    }

    static DL_MATH_INL HSL make( const S p[N] )
    {
        return op::from_ptr<HSL>( p );
    }

    static DL_MATH_INL HSL make( S h, S s, S l )
    {
        HSL o;
        o.h = h;
        o.s = s;
        o.l = l;
        return o;
    }

    template<typename S2, typename S3, typename S4>
    static DL_MATH_INL HSL make( S2 h, S3 s, S4 l )
    {
        return make( ( S )h, ( S )s, ( S )l );
    }

    template<typename S2>
    DL_EXPLICIT DL_MATH_INL operator HslT<S2>() const
    {
        return HslT<S2>::make( h, s, l );
    }

    DL_EXPLICIT DL_MATH_INL       operator V3() const { return v3; }
    DL_EXPLICIT DL_MATH_INL       operator C3() const { return math::toRgb( *this ); }
    DL_EXPLICIT DL_MATH_INL       operator C4() const { return math::toRgba( *this ); }

    DL_MATH_INL const S&           operator[]( Dim i ) const { return math::elem( *this, i ); }

    DL_MATH_INL UInt64             hash() const { return dl::ds::hash( *this ); }
    DL_MATH_INL HSL                abs() const { return math::abs( *this ); }
    DL_MATH_INL S                  min() const { return math::min( *this ); }
    DL_MATH_INL S                  max() const { return math::max( *this ); }
    DL_MATH_INL S                  avg() const { return math::avg( *this ); }
    DL_MATH_INL VecT<N, UInt32>    order() const { return math::order<N>( *this ); }
    DL_MATH_INL S                  sum() const { return math::sum( *this ); }
};

//=================================================================================================
// For working with ARGB environments like web & .NET.
//=================================================================================================

struct Argb8
{
    union
    {
        UInt32 u;
        struct { UInt8 b, g, r, a; };
    };

    static DL_MATH_INL Argb8 make( UInt32 u )
    {
        Argb8 o;
        o.u = u;
        return o;
    }

    static DL_MATH_INL Argb8 make( UInt8 a, UInt8 r, UInt8 g, UInt8 b )
    {
        Argb8 o;
        o.a = a;
        o.r = r;
        o.g = g;
        o.b = b;
        return o;
    }

    static DL_MATH_INL Argb8 make( Rgb8 c )
    {
        return make( 255, c.r, c.g, c.b );
    }

    static DL_MATH_INL Argb8 make( Rgba8 c )
    {
        return make( c.a, c.r, c.g, c.b );
    }

    template<typename T>
    static DL_MATH_INL Argb8 make( RgbT<T> c )
    {
        return make( ( Rgb8 )c );
    }

    template<typename T>
    static DL_MATH_INL Argb8 make( RgbaT<T> c )
    {
        return make( ( Rgba8 )c );
    }

    DL_MATH_INL Bool               operator==( Argb8 o ) { return u == o.u; }
    DL_MATH_INL Bool               operator!=( Argb8 o ) { return u != o.u; }

    DL_EXPLICIT DL_MATH_INL       operator UInt32() const { return u; }
    DL_EXPLICIT DL_MATH_INL       operator Rgb8() const { return Rgb8::make( r, g, b ); }
    DL_EXPLICIT DL_MATH_INL       operator Rgba8() const { return Rgba8::make( r, g, b, a ); }
    DL_EXPLICIT DL_MATH_INL       operator Rgbf() const { return ( Rgbf )( Rgb8 )*this; }
    DL_EXPLICIT DL_MATH_INL       operator Rgbaf() const { return ( Rgbaf )( Rgba8 )*this; }
    DL_EXPLICIT DL_MATH_INL       operator Rgbd() const { return ( Rgbd )( Rgb8 )*this; }
    DL_EXPLICIT DL_MATH_INL       operator Rgbad() const { return ( Rgbad )( Rgba8 )*this; }
    DL_EXPLICIT DL_MATH_INL       operator ColorRef() const;
};

//=================================================================================================
// For use with Microsoft's COLORREF struct. NOTE that the order is BGR.
//=================================================================================================

struct ColorRef
{
    union
    {
        UInt32 u;
        struct { UInt8 r, g, b, unused; };
    };

    static DL_MATH_INL ColorRef make( UInt32 u )
    {
        ColorRef o;
        o.u = u;
        o.unused = ( UInt8 )0; // Per MSDN.
        return o;
    }

    static DL_MATH_INL ColorRef make( UInt8 b, UInt8 g, UInt8 r )
    {
        ColorRef o;
        o.b = b;
        o.g = g;
        o.r = r;
        o.unused = ( UInt8 )0; // Per MSDN.
        return o;
    }

    static DL_MATH_INL ColorRef make( Rgb8 c )
    {
        return make( c.b, c.g, c.r );
    }

    static DL_MATH_INL ColorRef make( Rgba8 c )
    {
        return make( c.b, c.g, c.r );
    }

    template<typename T>
    static DL_MATH_INL ColorRef make( RgbT<T> c )
    {
        return make( ( Rgb8 )c );
    }

    template<typename T>
    static DL_MATH_INL ColorRef make( RgbaT<T> c )
    {
        return make( ( Rgb8 )c );
    }

    DL_MATH_INL Bool               operator==( ColorRef o ) { return u == o.u; }
    DL_MATH_INL Bool               operator!=( ColorRef o ) { return u != o.u; }

    DL_EXPLICIT DL_MATH_INL       operator UInt32() const { return u; }
    DL_EXPLICIT DL_MATH_INL       operator Rgb8() const { return Rgb8::make( r, g, b ); }
    DL_EXPLICIT DL_MATH_INL       operator Rgba8() const { return Rgba8::make( r, g, b ); }
    DL_EXPLICIT DL_MATH_INL       operator Rgbf() const { return ( Rgbf )( Rgb8 )*this; }
    DL_EXPLICIT DL_MATH_INL       operator Rgbaf() const { return ( Rgbaf )( Rgba8 )*this; }
    DL_EXPLICIT DL_MATH_INL       operator Rgbd() const { return ( Rgbd )( Rgb8 )*this; }
    DL_EXPLICIT DL_MATH_INL       operator Rgbad() const { return ( Rgbad )( Rgba8 )*this; }
    DL_EXPLICIT DL_MATH_INL       operator Argb8() const;
};

//=================================================================================================
// Region struct.
//=================================================================================================

template<typename S> struct RegionT
{
    VecT<2, S> size;
    VecT<2, S> offset;

    RegionT() :
        size( VecT<2, S>::zero ), offset( VecT<2, S>::zero ) { }

    RegionT( VecT<2, S> size, VecT<2, S> offset ) :
        size( size ), offset( offset ) { }

    S width() const         { return size.x; }
    S height() const        { return size.y; }
    S area() const          { return size.x * size.y; }

    S left() const          { return offset.x; }
    S top() const           { return offset.y; }
    S right() const         { return offset.x + size.x; }
    S bottom() const        { return offset.y + size.y; }

    Bool isEmpty() const    { return size == VecT<2, S>::zero; }
};

//=================================================================================================
// Global operations.
//=================================================================================================

DL_MATH_INL Vec2i project( Vec2i v, Vec2i n ) { return ( Vec2i )op::project<Double, Vec2d>( ( Vec2d )v, ( Vec2d )n ); }
DL_MATH_INL Vec3i project( Vec3i v, Vec3i n ) { return ( Vec3i )op::project<Double, Vec3d>( ( Vec3d )v, ( Vec3d )n ); }

DL_MATH_INL Vec2i reflect( Vec2i v, Vec2i n ) { return ( Vec2i )op::reflect<Double, Vec2d>( ( Vec2d )v, ( Vec2d )n ); }
DL_MATH_INL Vec3i reflect( Vec3i v, Vec3i n ) { return ( Vec3i )op::reflect<Double, Vec3d>( ( Vec3d )v, ( Vec3d )n ); }

DL_MATH_INL Double distance( Vec2i a, Vec2i b ) { return ( Double )op::distance<Double, Vec2d>( ( Vec2d )a, ( Vec2d )b ); }
DL_MATH_INL Double distance( Vec3i a, Vec3i b ) { return ( Double )op::distance<Double, Vec3d>( ( Vec3d )a, ( Vec3d )b ); }

DL_MATH_INL Pos2i project( Pos2i pt, Pos2i pl, Vec2i n ) { return ( Pos2i )op::project<Double, Pos2d>( ( Pos2d )pt, ( Pos2d )pl, ( Vec2d )n ); }
DL_MATH_INL Pos3i project( Pos3i pt, Pos3i pl, Vec3i n ) { return ( Pos3i )op::project<Double, Pos3d>( ( Pos3d )pt, ( Pos3d )pl, ( Vec3d )n ); }

DL_MATH_INL Pos2i reflect( Pos2i pt, Pos2i pl, Vec2i n ) { return ( Pos2i )op::reflect<Double, Pos2d>( ( Pos2d )pt, ( Pos2d )pl, ( Vec2d )n ); }
DL_MATH_INL Pos3i reflect( Pos3i pt, Pos3i pl, Vec3i n ) { return ( Pos3i )op::reflect<Double, Pos3d>( ( Pos3d )pt, ( Pos3d )pl, ( Vec3d )n ); }

//=================================================================================================
// Initialize static fields.
//=================================================================================================

// Vec2.
template<typename S> const VecT<2, S> VecT<2, S>::zero      = VecT<2, S>::make( 0, 0 );
template<typename S> const VecT<2, S> VecT<2, S>::one       = VecT<2, S>::make( 1, 1 );
template<typename S> const VecT<2, S> VecT<2, S>::unitX     = VecT<2, S>::make( 1, 0 );
template<typename S> const VecT<2, S> VecT<2, S>::unitY     = VecT<2, S>::make( 0, 1 );

// Pos2.
template<typename S> const PosT<2, S> PosT<2, S>::zero      = PosT<2, S>::make( 0, 0 );

// Vec3.
template<typename S> const VecT<3, S> VecT<3, S>::zero      = VecT<3, S>::make( 0, 0, 0 );
template<typename S> const VecT<3, S> VecT<3, S>::one       = VecT<3, S>::make( 1, 1, 1 );
template<typename S> const VecT<3, S> VecT<3, S>::unitX     = VecT<3, S>::make( 1, 0, 0 );
template<typename S> const VecT<3, S> VecT<3, S>::unitY     = VecT<3, S>::make( 0, 1, 0 );
template<typename S> const VecT<3, S> VecT<3, S>::unitZ     = VecT<3, S>::make( 0, 0, 1 );

// Pos3.
template<typename S> const PosT<3, S> PosT<3, S>::zero      = PosT<3, S>::make( 0, 0, 0 );

// Vec4.
template<typename S> const VecT<4, S> VecT<4, S>::zero      = VecT<4, S>::make( 0, 0, 0, 0 );
template<typename S> const VecT<4, S> VecT<4, S>::one       = VecT<4, S>::make( 1, 1, 1, 1 );
template<typename S> const VecT<4, S> VecT<4, S>::unitX     = VecT<4, S>::make( 1, 0, 0, 0 );
template<typename S> const VecT<4, S> VecT<4, S>::unitY     = VecT<4, S>::make( 0, 1, 0, 0 );
template<typename S> const VecT<4, S> VecT<4, S>::unitZ     = VecT<4, S>::make( 0, 0, 1, 0 );
template<typename S> const VecT<4, S> VecT<4, S>::unitW     = VecT<4, S>::make( 0, 0, 0, 1 );

// Quat.
template<typename S> const QuatT<S> QuatT<S>::zero          = QuatT<S>::make( 0, 0, 0, 0 );
template<typename S> const QuatT<S> QuatT<S>::identity      = QuatT<S>::make( 0, 0, 0, 1 );

// Mat3.
template<typename S> const MatT<3, S> MatT<3, S>::zero      = MatT<3, S>::make( 0, 0, 0, 0, 0, 0, 0, 0, 0 );
template<typename S> const MatT<3, S> MatT<3, S>::identity  = MatT<3, S>::make( 1, 0, 0, 0, 1, 0, 0, 0, 1 );

// Mat4.
template<typename S> const MatT<4, S> MatT<4, S>::zero      = MatT<4, S>::make( 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 );
template<typename S> const MatT<4, S> MatT<4, S>::identity  = MatT<4, S>::make( 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1 );

// Xform.
template<typename S> const XformT<S> XformT<S>::identity    = XformT::make( PosT<3, S>::zero, QuatT<S>::identity, VecT<3, S>::one );

// BBoxes.
template<typename S> const AabbT<S> AabbT<S>::identity      = AabbT::make( PosT<3, S>::zero, PosT<3, S>::zero );
template<typename S> const ObbT<S> ObbT<S>::identity        = ObbT::make( MatT<4, S>::identity, VecT<3, S>::zero );

// Colors.
#define DL_MAKE_STANDARD_COLORS(TYPE,T)                                                         \
    template<typename T> const TYPE<T> TYPE<T>::black       = TYPE<T>::make( 0, 0, 0 );         \
    template<typename T> const TYPE<T> TYPE<T>::white       = TYPE<T>::make( 1, 1, 1 );         \
    template<typename T> const TYPE<T> TYPE<T>::grey        = TYPE<T>::make( 0.5, 0.5, 0.5 );   \
    template<typename T> const TYPE<T> TYPE<T>::red         = TYPE<T>::make( 1, 0, 0 );         \
    template<typename T> const TYPE<T> TYPE<T>::green       = TYPE<T>::make( 0, 1, 0 );         \
    template<typename T> const TYPE<T> TYPE<T>::blue        = TYPE<T>::make( 0, 0, 1 );         \
    template<typename T> const TYPE<T> TYPE<T>::yellow      = TYPE<T>::make( 1, 1, 0 );         \
    template<typename T> const TYPE<T> TYPE<T>::cyan        = TYPE<T>::make( 0, 1, 1 );         \
    template<typename T> const TYPE<T> TYPE<T>::magenta     = TYPE<T>::make( 1, 0, 1 );

DL_MAKE_STANDARD_COLORS( RgbT, S )
DL_MAKE_STANDARD_COLORS( RgbaT, S )

//=================================================================================================
// RgbT Impl.
//=================================================================================================

template<typename S> DL_MATH_INL RgbT<S>::operator Rgb8() const { return Rgb8::make( r, g, b ); }
template<typename S> DL_MATH_INL RgbT<S>::operator Rgba8() const { return Rgba8::make( r, g, b ); }

//=================================================================================================
// RgbaT Impl.
//=================================================================================================

template<typename S> DL_MATH_INL RgbaT<S>::operator Rgb8() const { return Rgb8::make( r, g, b ); }
template<typename S> DL_MATH_INL RgbaT<S>::operator Rgba8() const { return Rgba8::make( r, g, b, a ); }

//=================================================================================================
// Rgb8 Impl.
//=================================================================================================

DL_MATH_INL RgbT<UInt8>::operator Rgbaf() const { return Rgbaf::make( ( Float )r/255.0f, ( Float )g/255.0f, ( Float )b/255.0f ); }
DL_MATH_INL RgbT<UInt8>::operator Rgbad() const { return Rgbad::make( ( Double )r/255.0, ( Double )g/255.0, ( Double )b/255.0 ); }
DL_MATH_INL RgbT<UInt8>::operator Rgba8() const { return Rgba8::make( r, g, b ); }

DL_MATH_INL RgbT<UInt8>::operator Rgbf() const { return ( Rgbf )( Rgbaf )( *this ); }
DL_MATH_INL RgbT<UInt8>::operator Rgbd() const { return ( Rgbd )( Rgbad )( *this ); }

DL_MATH_INL RgbT<UInt8>::operator Hsvf() const { return ( Hsvf )( Rgbf )*this; }
DL_MATH_INL RgbT<UInt8>::operator Hsvd() const { return ( Hsvd )( Rgbd )*this; }

DL_MATH_INL RgbT<UInt8>::operator Hslf() const { return ( Hslf )( Rgbf )*this; }
DL_MATH_INL RgbT<UInt8>::operator Hsld() const { return ( Hsld )( Rgbd )*this; }

DL_MATH_INL RgbT<UInt8>::operator Argb8() const { return Argb8::make( *this ); }
DL_MATH_INL RgbT<UInt8>::operator ColorRef() const { return ColorRef::make( *this ); }

//=================================================================================================
// Rgba8 Impl.
//=================================================================================================

DL_MATH_INL RgbaT<UInt8>::operator Rgbaf() const { return Rgbaf::make( ( Float )r/255.0f, ( Float )g/255.0f, ( Float )b/255.0f ); }
DL_MATH_INL RgbaT<UInt8>::operator Rgbad() const { return Rgbad::make( ( Double )r/255.0, ( Double )g/255.0, ( Double )b/255.0 ); }

DL_MATH_INL RgbaT<UInt8>::operator Rgbf() const { return ( Rgbf )( Rgbaf )( *this ); }
DL_MATH_INL RgbaT<UInt8>::operator Rgbd() const { return ( Rgbd )( Rgbad )( *this ); }
DL_MATH_INL RgbaT<UInt8>::operator Rgb8() const { return Rgb8::make( r, g, b ); }

DL_MATH_INL RgbaT<UInt8>::operator Hsvf() const { return ( Hsvf )( Rgbf )*this; }
DL_MATH_INL RgbaT<UInt8>::operator Hsvd() const { return ( Hsvd )( Rgbd )*this; }

DL_MATH_INL RgbaT<UInt8>::operator Hslf() const { return ( Hslf )( Rgbf )*this; }
DL_MATH_INL RgbaT<UInt8>::operator Hsld() const { return ( Hsld )( Rgbd )*this; }

DL_MATH_INL RgbaT<UInt8>::operator Argb8() const { return Argb8::make( *this ); }
DL_MATH_INL RgbaT<UInt8>::operator ColorRef() const { return ColorRef::make( *this ); }

//=================================================================================================
// Argb8 Impl.
//=================================================================================================

DL_MATH_INL Argb8::operator ColorRef() const { return ( ColorRef )( Rgb8 )*this; }

template<typename Stream> static DL_MATH_INL Stream& operator<<( Stream& s, Argb8 c ) { return s << c.u; }
template<typename Stream> static DL_MATH_INL Stream& operator>>( Stream& s, Argb8& c ) { s >> c.u; return s; }

//=================================================================================================
// ColorRef Impl.
//=================================================================================================

DL_MATH_INL ColorRef::operator Argb8() const { return ( Argb8 )( Rgb8 )*this; }

template<typename Stream> static DL_MATH_INL Stream& operator<<( Stream& s, ColorRef c ) { return s << c.u; }
template<typename Stream> static DL_MATH_INL Stream& operator>>( Stream& s, ColorRef& c ) { s >> c.u; return s; }

//=================================================================================================
//  Pop pragmas.
//=================================================================================================

#if defined(_MSC_VER)
    #pragma warning( pop )
#elif defined(__clang__)
    #pragma clang diagnostic pop
#elif defined(__GNUC__)
    #pragma GCC diagnostic pop
#endif

//=================================================================================================
// Ensure that Float tuple sizes are correct.
//=================================================================================================

#if !defined( DL_NO_STATIC_ASSERT )
    DL_SASSERT( sizeof( Vec2i )    ==  2 * sizeof( Int32 ) );
    DL_SASSERT( sizeof( Pos2i )    ==  2 * sizeof( Int32 ) );
    DL_SASSERT( sizeof( Vec3i )    ==  3 * sizeof( Int32 ) );
    DL_SASSERT( sizeof( Pos3i )    ==  3 * sizeof( Int32 ) );
    DL_SASSERT( sizeof( Vec4i )    ==  4 * sizeof( Int32 ) );
    DL_SASSERT( sizeof( Quati )    ==  4 * sizeof( Int32 ) );
    DL_SASSERT( sizeof( Mat3i )    ==  9 * sizeof( Int32 ) );
    DL_SASSERT( sizeof( Mat4i )    == 16 * sizeof( Int32 ) );
    DL_SASSERT( sizeof( Xformi )   == 10 * sizeof( Int32 ) );
    DL_SASSERT( sizeof( Regioni )  ==  4 * sizeof( Int32 ) );
    DL_SASSERT( sizeof( Aabbi )    ==  6 * sizeof( Int32 ) );
    DL_SASSERT( sizeof( Obbi )     == 19 * sizeof( Int32 ) );

    DL_SASSERT( sizeof( Vec2u )    ==  2 * sizeof( UInt32 ) );
    DL_SASSERT( sizeof( Pos2u )    ==  2 * sizeof( UInt32 ) );
    DL_SASSERT( sizeof( Vec3u )    ==  3 * sizeof( UInt32 ) );
    DL_SASSERT( sizeof( Pos3u )    ==  3 * sizeof( UInt32 ) );
    DL_SASSERT( sizeof( Vec4u )    ==  4 * sizeof( UInt32 ) );
    DL_SASSERT( sizeof( Quatu )    ==  4 * sizeof( UInt32 ) );
    DL_SASSERT( sizeof( Mat3u )    ==  9 * sizeof( UInt32 ) );
    DL_SASSERT( sizeof( Mat4u )    == 16 * sizeof( UInt32 ) );
    DL_SASSERT( sizeof( Xformu )   == 10 * sizeof( UInt32 ) );
    DL_SASSERT( sizeof( Regionu )  ==  4 * sizeof( UInt32 ) );
    DL_SASSERT( sizeof( Aabbu )    ==  6 * sizeof( UInt32 ) );
    DL_SASSERT( sizeof( Obbu )     == 19 * sizeof( UInt32 ) );

    DL_SASSERT( sizeof( Vec2f )    ==  2 * sizeof( Float ) );
    DL_SASSERT( sizeof( Pos2f )    ==  2 * sizeof( Float ) );
    DL_SASSERT( sizeof( Vec3f )    ==  3 * sizeof( Float ) );
    DL_SASSERT( sizeof( Pos3f )    ==  3 * sizeof( Float ) );
    DL_SASSERT( sizeof( Vec4f )    ==  4 * sizeof( Float ) );
    DL_SASSERT( sizeof( Quatf )    ==  4 * sizeof( Float ) );
    DL_SASSERT( sizeof( Mat3f )    ==  9 * sizeof( Float ) );
    DL_SASSERT( sizeof( Mat4f )    == 16 * sizeof( Float ) );
    DL_SASSERT( sizeof( Xformf )   == 10 * sizeof( Float ) );
    DL_SASSERT( sizeof( Regionf )  ==  4 * sizeof( Float ) );
    DL_SASSERT( sizeof( Aabbf )    ==  6 * sizeof( Float ) );
    DL_SASSERT( sizeof( Obbf )     == 19 * sizeof( Float ) );
    DL_SASSERT( sizeof( Rgbf )     ==  3 * sizeof( Float ) );
    DL_SASSERT( sizeof( Rgbaf )    ==  4 * sizeof( Float ) );
    DL_SASSERT( sizeof( Hsvf )     ==  3 * sizeof( Float ) );
    DL_SASSERT( sizeof( Hslf )     ==  3 * sizeof( Float ) );

    DL_SASSERT( sizeof( Vec2d )    ==  2 * sizeof( Double ) );
    DL_SASSERT( sizeof( Pos2d )    ==  2 * sizeof( Double ) );
    DL_SASSERT( sizeof( Vec3d )    ==  3 * sizeof( Double ) );
    DL_SASSERT( sizeof( Pos3d )    ==  3 * sizeof( Double ) );
    DL_SASSERT( sizeof( Vec4d )    ==  4 * sizeof( Double ) );
    DL_SASSERT( sizeof( Quatd )    ==  4 * sizeof( Double ) );
    DL_SASSERT( sizeof( Mat3d )    ==  9 * sizeof( Double ) );
    DL_SASSERT( sizeof( Mat4d )    == 16 * sizeof( Double ) );
    DL_SASSERT( sizeof( Xformd )   == 10 * sizeof( Double ) );
    DL_SASSERT( sizeof( Regiond )  ==  4 * sizeof( Double ) );
    DL_SASSERT( sizeof( Aabbd )    ==  6 * sizeof( Double ) );
    DL_SASSERT( sizeof( Obbd )     == 19 * sizeof( Double ) );
    DL_SASSERT( sizeof( Rgbd )     ==  3 * sizeof( Double ) );
    DL_SASSERT( sizeof( Rgbad )    ==  4 * sizeof( Double ) );
    DL_SASSERT( sizeof( Hsvd )     ==  3 * sizeof( Double ) );
    DL_SASSERT( sizeof( Hsld )     ==  3 * sizeof( Double ) );

    DL_SASSERT( sizeof( Rgb8 )     ==  3 * sizeof( UInt8 ) );
    DL_SASSERT( sizeof( Rgba8 )    ==  4 * sizeof( UInt8 ) );
    DL_SASSERT( sizeof( Argb8 )    ==  4 * sizeof( UInt8 ) );
    DL_SASSERT( sizeof( ColorRef ) ==  4 * sizeof( UInt8 ) );
#endif

//=================================================================================================
//  Ensure that types are really POD.
//=================================================================================================

#if DL_MATH_CHECK_PODNESS && !defined( DL_NO_STATIC_ASSERT )
#include <type_traits>
    DL_SASSERT( std::is_pod<Vec2d>() );
    DL_SASSERT( std::is_pod<Pos2d>() );
    DL_SASSERT( std::is_pod<Vec3d>() );
    DL_SASSERT( std::is_pod<Pos3d>() );
    DL_SASSERT( std::is_pod<Vec4d>() );
    DL_SASSERT( std::is_pod<Quatd>() );
    DL_SASSERT( std::is_pod<Mat3d>() );
    DL_SASSERT( std::is_pod<Mat4d>() );
    DL_SASSERT( std::is_pod<Xformd>() );
    DL_SASSERT( std::is_pod<Aabbd>() );
    DL_SASSERT( std::is_pod<Obbd>() );
    DL_SASSERT( std::is_pod<Rgbd>() );
    DL_SASSERT( std::is_pod<Rgb8>() );
    DL_SASSERT( std::is_pod<Rgbad>() );
    DL_SASSERT( std::is_pod<Rgba8>() );
